{
  "backend/main.mo": "Main actor for a news platform backend defining data models (Article, CitizenPost, Comment, MediaItem, UserProfile) and CRUD/role-management functions with access control and migration support.",
  "backend/migration.mo": "Defines a migration module that transforms old actor state into a new shape with a userRegistry map and userRegistryCounter, used on canister upgrade.",
  "feature_evidence.json": "Feature evidence report mapping planned frontend features (role system hooks, DashboardPage, user management tab) to their target files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted catalogue of short summaries for every frontend source file, describing each component or page's purpose and notable recent changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark mode color tokens (background, foreground, primary, sidebar, charts, etc.).",
  "frontend/index.html": "HTML shell for the React app with the page title set to 'Global Nexus' and a logo favicon, mounting the app at #root.",
  "frontend/src/App.tsx": "Defines all TanStack Router routes (home, category, article, citizen news, multimedia, admin, dashboard, about, privacy, terms) wrapped in a LanguageProvider and Layout.",
  "frontend/src/components/ArticleCard.tsx": "Reusable article card component supporting default and compact variants, displaying image, category badge, title (with Hindi support), author, and formatted date with a blue breaking-news badge.",
  "frontend/src/components/ArticleManagement.tsx": "Admin component that displays a table of all articles with title, category, author, date, and breaking/featured flags, along with a form to create new articles.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Horizontally scrolling ticker bar that displays breaking news headlines (with Hindi support) fetched from the backend.",
  "frontend/src/components/CategoryBadge.tsx": "Small colored badge component that renders a localized, styled label for a given article category.",
  "frontend/src/components/CategorySection.tsx": "Displays up to four article cards for a given category with a header, loading skeleton, empty state, and a 'view all' link.",
  "frontend/src/components/CitizenPostCard.tsx": "Card component linking to a citizen post detail page, showing image, category badge, optional status badge, title, author, and date.",
  "frontend/src/components/CitizenPostModeration.tsx": "Admin moderation panel listing all citizen posts with their status, allowing admins to approve or reject pending posts.",
  "frontend/src/components/CommentsSection.tsx": "Displays comments for an article or citizen post and provides an authenticated form for logged-in users to submit new comments.",
  "frontend/src/components/CreateArticleForm.tsx": "A form component for creating news articles with fields for title, body, author, category, and flags like breaking/featured, supporting both English and Hindi inputs with validation and success/error feedback.",
  "frontend/src/components/FeaturedHero.tsx": "Displays a large hero banner for a featured article with a background image, gradient overlay, title, excerpt, and metadata; handles loading and empty states.",
  "frontend/src/components/LanguageToggle.tsx": "A small toggle button that switches the app language between English and Hindi using the LanguageContext.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky header with navigation links, category nav, login button, language toggle, breaking news ticker, and a profile setup modal trigger.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication, rendering a login button for unauthenticated users and a logout button with the user's profile name for authenticated users.",
  "frontend/src/components/MediaCard.tsx": "Displays a media item card (video, podcast, or reel) with a thumbnail, type badge, hover play overlay, and an action button that either opens an embed or triggers a play callback.",
  "frontend/src/components/PrincipalIdDisplay.tsx": "Shows the authenticated user's truncated Internet Identity principal ID with a copy-to-clipboard button.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter a display name to create their profile, blocking dismissal until submitted.",
  "frontend/src/components/RelatedArticles.tsx": "Renders up to three related articles from the same category as the current article, excluding the current one, using the compact ArticleCard variant.",
  "frontend/src/components/Sidebar.tsx": "Renders a sidebar with a 'Most Read' articles list and a 'Citizen Spotlight' section showing approved citizen posts, with links to full articles and the citizen news page.",
  "frontend/src/components/SubmitStoryModal.tsx": "A modal dialog form that allows authenticated users to submit a citizen story with title, body, category, and optional image URL, showing a success state after submission.",
  "frontend/src/components/UserManagement.tsx": "Admin UI component for viewing the user role registry, assigning roles to users by Principal ID, and revoking existing roles, with copy-to-clipboard support for Principal IDs.",
  "frontend/src/components/VideoPlayerModal.tsx": "A modal dialog that embeds a responsive 16:9 iframe video player for a given embed URL and title.",
  "frontend/src/constants/translations.ts": "Defines English and Hindi translation string objects covering all UI sections including navigation, articles, citizen reports, admin, and common labels.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for managing the active UI language ('en' or 'hi'), persisting the selection to sessionStorage and exposing toggle/set functions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including articles, citizen posts, comments, media, and user profiles via the ICP actor.",
  "frontend/src/hooks/useTranslation.ts": "A simple hook that returns the translation object and current language by combining the LanguageContext with the translations constants.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for the Global Nexus color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying a founder profile card with photo, bio, and credentials for Pawnesh Kumar Singh, the founder of Global Nexus.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that guards access by checking authentication and admin role, then renders tabbed panels for article management and citizen post moderation.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Article detail page that fetches articles by ID, displays the full article with title, hero image, body, author metadata, and renders related articles and a comments section.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a paginated grid of articles for a given category, mapping URL params to ArticleCategory enum values and showing a header with category badge and article count.",
  "frontend/src/pages/CitizenNewsPage.tsx": "Shows approved citizen-submitted posts with category filters and a header banner; authenticated users can open a SubmitStoryModal to submit new stories.",
  "frontend/src/pages/CitizenPostDetailPage.tsx": "Renders the full detail view of a single citizen post including image, body, status badge, and a comments section, with a back link to the citizen news listing.",
  "frontend/src/pages/DashboardPage.tsx": "Protected dashboard page that shows different views based on user role: admins get tabbed management panels (articles, moderation, users), while unassigned users see a prompt to contact an admin.",
  "frontend/src/pages/HomePage.tsx": "Home page that renders a featured hero article, a sidebar, and per-category article sections by fetching featured and category-specific articles.",
  "frontend/src/pages/MultimediaPage.tsx": "Multimedia page with tabbed sections for videos, podcasts, and reels fetched from the backend, supporting video playback via a modal.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page for Global Nexus with a hero banner and numbered sections covering data collection, user rights, security, and contact information.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Renders the Terms of Service page for Global Nexus with a hero banner and numbered sections covering user responsibilities, content submission, legal compliance, and termination policies.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the Global Nexus design system: blue/black brand colors, Playfair Display and Noto Sans font families, custom shadows, border radii, and ticker/accordion keyframe animations.",
  "project_state.json": "Tracks the overall project state (version 15) for the Global Nexus multilingual news platform, documenting existing features, architectural notes, known issues, and the role-based auth system being implemented."
}