{
  "backend/main.mo": "Main Motoko actor defining data types (Article, CitizenPost, Comment, MediaItem, UserProfile) and backend logic including CRUD operations, role management via AccessControl/MixinAuthorization, and seed data initialization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Privacy Policy page, Terms of Service page, footer link updates) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document providing one-line summaries of each frontend source file, describing their purpose and notable recent changes such as color theme updates and new page additions.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark mode color tokens including background, foreground, primary, and sidebar variables.",
  "frontend/index.html": "HTML shell for the React SPA with the page title set to 'Global Nexus', a logo favicon, and a root div that loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes including /privacy and /terms, wrapping the layout in a LanguageProvider.",
  "frontend/src/components/ArticleCard.tsx": "Reusable article card component supporting default and compact variants, displaying article image, title (with Hindi support), category badge, author, date, and a blue breaking-news badge.",
  "frontend/src/components/ArticleManagement.tsx": "Admin component that displays a table of all articles with title, category, author, date, and breaking/featured flags, plus a form to create new articles.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Horizontally scrolling ticker bar that displays breaking news headlines (with Hindi support) fetched from the backend.",
  "frontend/src/components/CategoryBadge.tsx": "Small colored badge component that renders a localized, styled label for a given article category.",
  "frontend/src/components/CategorySection.tsx": "Displays up to four article cards for a given category with a header, loading skeleton, empty state, and a 'view all' link.",
  "frontend/src/components/CitizenPostCard.tsx": "Card component linking to a citizen post detail page, showing image, category badge, optional status badge, title, author, and date.",
  "frontend/src/components/CitizenPostModeration.tsx": "Admin moderation panel listing all citizen posts with approve/reject action buttons for pending submissions.",
  "frontend/src/components/CommentsSection.tsx": "Displays comments for an article or citizen post and provides an authenticated form to submit new comments.",
  "frontend/src/components/CreateArticleForm.tsx": "A form component for creating news articles with fields for title, body, author, category, and flags like breaking/featured, supporting both English and Hindi inputs with success/error feedback.",
  "frontend/src/components/FeaturedHero.tsx": "Displays a full-width hero banner for a featured article with a background image, gradient overlay, title, excerpt, and metadata; handles loading and empty states.",
  "frontend/src/components/LanguageToggle.tsx": "A small toggle button that switches the app language between English and Hindi using the LanguageContext.",
  "frontend/src/components/Layout.tsx": "The main app shell with a sticky header, category navigation links, mobile menu, authentication controls, breaking news ticker, and an Outlet for page content.",
  "frontend/src/components/LoginButton.tsx": "Renders a login or logout button using Internet Identity authentication, showing the user's profile name when authenticated.",
  "frontend/src/components/MediaCard.tsx": "Displays a media item card (video, podcast, or reel) with a thumbnail, type badge, hover play overlay, and a click handler to play or open the media.",
  "frontend/src/components/PrincipalIdDisplay.tsx": "Shows the authenticated user's truncated Internet Identity principal ID with a copy-to-clipboard button.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter a display name to create their profile, blocking dismissal until submitted.",
  "frontend/src/components/RelatedArticles.tsx": "Renders up to three related articles from the same category as the current article, excluding the current one, using compact ArticleCard components.",
  "frontend/src/components/Sidebar.tsx": "Renders a sidebar with a 'Most Read' articles list and a 'Citizen Spotlight' section showing approved citizen posts, both linking to their respective detail pages.",
  "frontend/src/components/SubmitStoryModal.tsx": "A dialog modal form that allows authenticated users to submit a citizen story with title, body, category, and optional image URL, showing a success state after submission.",
  "frontend/src/components/VideoPlayerModal.tsx": "A dialog modal that embeds a responsive 16:9 iframe video player for a given embed URL and title.",
  "frontend/src/constants/translations.ts": "Defines English and Hindi translation strings for all UI sections including navigation, auth, articles, citizen reports, admin, and common labels.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for managing the active language ('en' or 'hi') with persistence via sessionStorage and toggle/set functions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating articles, citizen posts, and comments via the backend actor, including queries for breaking news, categories, comments, and mutations for creating/updating posts.",
  "frontend/src/hooks/useTranslation.ts": "A hook that returns the current language's translation object and language code by reading from LanguageContext and the translations constants.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for the Global Nexus color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying a founder profile card with photo, bio, and credentials for Pawnesh Kumar Singh, the CEO of Global Nexus.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that checks authentication and admin status, then renders tabbed panels for article management and citizen post moderation.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Article detail page that fetches all articles, finds the one matching the URL id, and renders the title, hero image, body, and comments section with language-aware content.",
  "frontend/src/pages/CategoryPage.tsx": "Category listing page that fetches articles by category from the URL param and displays them in a paginated grid with navigation controls.",
  "frontend/src/pages/CitizenNewsPage.tsx": "Displays a filterable grid of approved citizen-submitted news posts with a header banner and a submit story modal for authenticated users.",
  "frontend/src/pages/CitizenPostDetailPage.tsx": "Shows the full detail view of a single citizen post by ID, including title, author, image, body, status badge, and a comments section.",
  "frontend/src/pages/HomePage.tsx": "Renders the main home page with a featured hero article, a sidebar, and per-category article sections for all defined categories.",
  "frontend/src/pages/MultimediaPage.tsx": "Displays media content (videos, podcasts, reels) in a tabbed layout with a video player modal for playback.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static page rendering the Global Nexus privacy policy as numbered sections covering data collection, usage, security, and user rights.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Static page rendering the Global Nexus Terms of Service as numbered sections covering user responsibilities, content submission, legal compliance, and more.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Global Nexus frontend, defining custom colors (blue/black brand palette), fonts, border radii, shadows, and keyframe animations including a news ticker scroll.",
  "project_state.json": "Project state snapshot (version 11) describing the Global Nexus multilingual news platform's features, architecture, known issues, and existing feature inventory including nav, homepage, admin, multimedia, and legal pages."
}