{
  "backend/main.mo": "Main Motoko actor for the Global Nexus backend, defining data models (Article, CitizenPost, Comment, MediaItem, UserProfile) and CRUD operations with role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (PWA manifest, index.html meta tags, service worker) to their source files, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of each frontend source file, describing component responsibilities and recent changes such as blue color scheme updates and new PWA features.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark mode color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the Global Nexus app with full PWA support including manifest link, theme-color, Apple and Microsoft meta tags, and an inline service worker registration script.",
  "frontend/public/manifest.json": "PWA web app manifest for Global Nexus specifying app name, display mode, orientation, brand colors, and references to 192×192 and 512×512 PNG icons.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static app shell assets and a network-first (pass-through) strategy for ICP canister and API calls, with old cache cleanup on activation.",
  "frontend/src/App.tsx": "React application root that configures TanStack Router with all page routes (home, category, article, citizen news, multimedia, admin, dashboard, about, privacy, terms) wrapped in a LanguageProvider and Layout.",
  "frontend/src/components/ArticleCard.tsx": "Renders a news article card with image, title, category badge, author, and date in two variants: 'default' (full card) and 'compact' (small thumbnail row). Links to the article detail page and supports Hindi/English title switching.",
  "frontend/src/components/ArticleManagement.tsx": "Admin panel component that displays a table of all articles with category, author, date, and breaking/featured flags, alongside the CreateArticleForm for adding new articles.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Horizontally scrolling ticker bar that displays breaking news headlines fetched from the backend, with a 'Breaking News' label and seamless looping animation.",
  "frontend/src/components/CategoryBadge.tsx": "Small colored badge component that displays a localized category label with predefined color styles mapped to each article category.",
  "frontend/src/components/CategorySection.tsx": "Displays a section header with a category label and 'View All' link, then renders up to four ArticleCards in a responsive grid with loading skeletons and an empty state.",
  "frontend/src/components/CitizenPostCard.tsx": "Card component for citizen-submitted posts showing image or placeholder, category badge, optional status badge (pending/approved/rejected), title, author, and date, linking to the post detail page.",
  "frontend/src/components/CitizenPostModeration.tsx": "Admin moderation panel listing all citizen posts with their status, allowing admins to approve or reject pending posts via action buttons with loading state handling.",
  "frontend/src/components/CommentsSection.tsx": "Displays a comments list for an article or citizen post and provides an authenticated comment submission form; shows a login prompt for unauthenticated users.",
  "frontend/src/components/CreateArticleForm.tsx": "A form component for creating news articles with fields for title, body, author, category, and flags like breaking/featured, supporting both English and Hindi inputs with validation and success/error feedback.",
  "frontend/src/components/FeaturedHero.tsx": "Displays a full-width hero banner for a featured article with a background image, gradient overlay, title, excerpt, and metadata; handles loading and empty states.",
  "frontend/src/components/LanguageToggle.tsx": "A small toggle button that switches the app language between English and Hindi using the LanguageContext.",
  "frontend/src/components/Layout.tsx": "The main app shell with a sticky header, category navigation, login button, language toggle, breaking news ticker, and an Outlet for page content; also handles profile setup modal display.",
  "frontend/src/components/LoginButton.tsx": "Renders a login or logout button using Internet Identity authentication, showing the user's profile name when authenticated and handling login/logout state transitions.",
  "frontend/src/components/MediaCard.tsx": "Displays a media item card (video, podcast, or reel) with a thumbnail, type badge, hover play overlay, and a contextual action button that either triggers an onPlay callback or opens an external URL.",
  "frontend/src/components/PrincipalIdDisplay.tsx": "Shows the authenticated user's truncated Internet Identity principal ID with a copy-to-clipboard button and visual confirmation feedback.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name and saves their profile via the `useSaveCallerUserProfile` mutation before they can proceed.",
  "frontend/src/components/PWAInstallPrompt.tsx": "A fixed bottom banner that prompts users to install the app as a PWA using the beforeinstallprompt event, with persistent dismissal stored in localStorage.",
  "frontend/src/components/RelatedArticles.tsx": "Renders up to 3 related articles filtered by the same category as the current article, displayed as compact ArticleCards.",
  "frontend/src/components/Sidebar.tsx": "A sidebar component showing a 'Most Read' list of articles and a 'Citizen Spotlight' section of approved citizen posts, both with navigation links.",
  "frontend/src/components/SubmitStoryModal.tsx": "A modal form allowing authenticated users to submit a citizen news story with title, body, category, and optional image URL, showing a success state after submission.",
  "frontend/src/components/UserManagement.tsx": "An admin UI component for viewing the user role registry and assigning or revoking roles (admin/user/guest) by Principal ID.",
  "frontend/src/components/VideoPlayerModal.tsx": "A modal dialog that embeds a responsive 16:9 iframe video player given an embed URL and title.",
  "frontend/src/constants/translations.ts": "Defines English (and presumably Hindi) translation string objects covering all UI sections including nav, auth, articles, citizen reports, admin, and more.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for managing the active UI language ('en' or 'hi'), persisting the selection to sessionStorage.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including articles, citizen posts, comments, media, and user profiles via the ICP actor.",
  "frontend/src/hooks/useTranslation.ts": "A simple hook that returns the translation object and current language for the active locale using the LanguageContext and translations constants.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for the Global Nexus color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying the founder's profile card, photo, bio, and credentials for Global Nexus.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that guards access by checking authentication and admin role, then renders tabbed views for article management and citizen post moderation.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Article detail page that fetches and displays a single article by ID with its title, body, hero image, author info, and a comments section, supporting bilingual (English/Hindi) content.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a paginated grid of articles for a given category, mapping URL param to ArticleCategory enum and showing 12 articles per page with prev/next controls.",
  "frontend/src/pages/CitizenNewsPage.tsx": "Lists approved citizen-submitted posts with category filters and a header banner; authenticated users can open a SubmitStoryModal to submit new stories.",
  "frontend/src/pages/CitizenPostDetailPage.tsx": "Shows the full detail view of a single citizen post by ID, including title, author, image, body paragraphs, status badge, and a comments section.",
  "frontend/src/pages/DashboardPage.tsx": "Protected dashboard page that renders different views based on user role: admins get tabbed management panels (articles, moderation, users), while unassigned users see a prompt to contact an admin.",
  "frontend/src/pages/HomePage.tsx": "Home page that renders a featured hero article alongside a sidebar, followed by per-category article sections for all six categories.",
  "frontend/src/pages/MultimediaPage.tsx": "Multimedia page with tabbed views for videos, podcasts, and reels fetched from the backend, rendering MediaCards and opening a VideoPlayerModal on video play.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page for Global Nexus with a hero banner and numbered sections covering data collection, user rights, security, and contact information.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Renders the Terms of Service page for Global Nexus with a hero banner and numbered sections covering user responsibilities, content submission, legal compliance, and termination policies.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the Global Nexus design system: custom brand colors (blue/charcoal), headline/body font families, shadow tokens, and keyframe animations including a news ticker scroll.",
  "project_state.json": "Tracks the overall project state (version 17) for the Global Nexus platform, documenting existing features, architectural notes, known issues, PWA conversion progress, and image requirements."
}